app/controllers/tasks_controller.rb

    task = Task.find(params[:id])
    task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 3]]