app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"

  def show
    id = params[:id].to_i
    @task = Task.find(params[:id].to_i)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    if Task.create(:chore => params[:task][:chore], :status => "Not Complete")
---
INSERT INTO "tasks" ("chore", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["chore", "Eat a cake"], ["status", "Not Done"], ["created_at", "2018-09-21 20:45:41.837590"], ["updated_at", "2018-09-21 20:45:41.837590"]]

  def edit
    id = params[:id].to_i
    @task = Task.find(params[:id].to_i)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    task = Task.find(params[:id].to_i)
    task.update(:chore => params[:task][:chore], :status => params[:task][:status] )
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", "sdsdsdsd"], ["updated_at", "2018-09-21 20:51:43.115256"], ["id", 17]]

    task = Task.find(params[:id].to_i)

    if task.completion_date
      task.completion_date = nil
      task.status = "Not Complete"
    else
      task.completion_date = Date.today
      task.status = "Complete"
    end
    task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "status" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["completion_date", nil], ["status", "Not Complete"], ["updated_at", "2018-09-26 20:50:17.361108"], ["id", 6]]

    task = Task.find(params[:id].to_i)
    task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 33]]